<html>
<head>
<title>Creaci&oacute;n de marcos</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff" >
<main>
<p class="formatotitulo" >Creaci&oacute;n de marcos  </p>
  <p class="formatoparrafo" >El dise&ntilde;o 
    profesional de una p&aacute;gina web educativa implica definir 
    adecuadamente la distribuci&oacute;n de la informaci&oacute;n (textos, im&aacute;genes, 
    sonidos, animaciones  y videos) en el espacio de la pantalla, para ello, se requiere 
    dividirla en secciones,  
    cada secci&oacute;n tiene una funci&oacute;n específica, por ejemplo se tiene la pantalla dividida en dos secciones rectangulares 
    horizontalmente, la parte superior  se ocupa para identificar  
    la instituci&oacute;n, la secci&oacute;n 
    inferior  es destinada a ubicar el &iacute;ndice 
    y el contenido de la p&aacute;gina web.</p>
  <p class="formatoparrafo" >Al momento de dividir 
    la pantalla en varias secciones, a cada una de ellas se debe asignar un nombre 
    y colocarle un archivo web,  tomando 
    como referencia otro caso t&iacute;pico de dividir la pantalla en dos secciones 
    verticales,  la primera secci&oacute;n se le asigna el nombre de izquierda 
    y se  coloca el archivo web que contiene el 
    &iacute;ndice de la p&aacute;gina,  continuando con la otra secci&oacute;n se  define 
    como  derecha y ubicar en ella un archivo web de portada.</p>
  <p class="formatoparrafo" >Un punto clave 
    al dividir la pantalla en secciones consiste en observar que el archivo web 
    que contiene la divisi&oacute;n en secciones de la pantalla, no tiene la etiqueta    <span class="formatoetiquetashtml">&lt;body&gt;</span>, es decir, solamente se definen los marcos, sus nombres y los archivos 
    web que se colocan en cada uno de ellos, por tal raz&oacute;n, &eacute;ste 
    archivo se abre cuando se accesa un sitio web y 
recibe el nombre de default.htm o index.htm</p>
<p class="formatoparrafo" >&nbsp;</p>
    <table width="98%" border="0" cellpadding="15">
    <tr>
      <td width="36"><a href="documentos/tema11/u2_t11_pdf1.pdf" title="Metodolog&iacute;a 
  para crear los marcos" target="new"><img src="../imagenes/icono_lectorpdf.jpg" title="Metodolog&iacute;a 
  para crear los marcos" width="36" height="36"></a></td>
      <td width="785" ><span class="formatosubtitulo"><a href="documentos/tema11/u2_t11_pdf1.pdf" title="Metodolog&iacute;a 
 para crear los marcos" target="new">Metodolog&iacute;a 
  para crear los marcos</a></span></td>
    </tr>
</table>
<p class="formatoparrafo" >A continuaci&oacute;n se aplica la metodolog&iacute;a de marcos para la divisi&oacute;n de la pantalla en secciones que permitan la distribuci&oacute;n y visualizaci&oacute;n de las especialidades  de la unidad acad&eacute;mica de una manera  eficiente en el navegador. </p>
  <p class="formatosubtituloactividad" >Actividad de aprendizaje 7 parte 1</p>
  <p class="formatosubtituloactividad" >Creaci&oacute;n de marcos  en una p&aacute;gina web usando etiquetas html</p>
<p class="formatoparrafo">Esta secci&oacute;n de la actividad de aprendizaje consiste en crear una divisi&oacute;n aplicando el tema de marcos <span class="formatoetiquetashtml">(frameset)</span>, la columna de la izquierda ocupa 30% y la derecha  70%, esto con la finalidad de lograr una  distribuci&oacute;n y dise&ntilde;o del proyecto. La columna de la izquierda tiene al archivo indice.htm y en la  derecha  el archivo portada.htm, en la sección izquierda se indican las carreras que ofrece la escuela, adem&aacute;s una presentaci&oacute;n y un video de la unidad acad&eacute;mica, al dar clic en una opción el contenido se observa en la secci&oacute;n derecha.
La divisi&oacute;n de la pantalla en dos columnas por medio de la etiqueta <span class="formatoetiquetashtml">(frameset)</span>, debe tener espaciamiento y borde entre los marcos.</p>
  <p class="formatoparrafo" >El archivo que crea la divisi&oacute;n de la pantalla en dos columnas se llama default.htm, la primera columna ocupa el 30% de la pantalla, se asigna el nombre de izquierda, se indica que las barras de desplazamiento se coloquen autom&aacute;ticamente, no se permite que el usuario pueda modificar el tama&ntilde;o del marco. La segunda columna tiene un tama&ntilde;o 70% de la pantalla, con nombre derecha, las barras de desplazamiento se colocan autom&aacute;ticamente y no se permite cambiar el tama&ntilde;o del marco (Help Adobe Dreamweaver, 2013).</p>
  <p class="formatoparrafo" >En el video 58 se explica el procedimiento para crear un conjunto de marcos que divida la pantalla en  dos columnas, en la secci&oacute;n izquierda se coloca el &iacute;ndice y en la derecha  portada.</p>
  <p class="formatoparrafo" >&nbsp;</p>
<p align="center">
<video src="audiovideo/u2_tema11_1.mp4" class="formatoajusteimagen"  controls title="Creación de marcos utilizando etiquetas html"></video>
 </p>
<p class="formatotitulofiguras" >Video 58. Creación de marcos utilizando etiquetas html.</p>
<p align="center">&nbsp;</p> 
<table width="98%" border="0" cellpadding="15">
    <tr>
      <td width="36"><a href="documentos/tema11/u2_t11_pdf2.pdf" target="new"><img src="../imagenes/icono_lectorpdf.jpg" title="Creaci&oacute;n de marcos"></a></td>
      <td width="785" ><span class="formatosubtitulo"><a href="documentos/tema11/u2_t11_pdf2.pdf" title="Creaci&oacute;n de marcos"  target="new">Creaci&oacute;n de marcos  en una p&aacute;gina web usando etiquetas</a></span></td>
  </tr>
</table>
  <p class="formatoparrafo">Al momento de probar el archivo  indice.htm ubicado en la columna izquierda, al dar clic sobre un taller  se debe observar   el contenido de la especialidad en la sección derecha, para ello, hay que adecuar los vínculos en el archivo indice.htm como se indica en la siguiente secci&oacute;n.</p>
  <p>&nbsp;</p>
  <p class="formatosubtituloactividad" >Actividad de aprendizaje 7 parte 2</p>
  <p class="formatosubtituloactividad" >Direccionando los vínculos con el par&aacute;metro target</p>
  <p class="formatoparrafo" >En esta parte de la actividad de aprendizaje se direccionan los enlaces de las especialidades para mostrar el contenido en el marco nombrado derecha, esta actualizaci&oacute;n se realiza en el archivo indice.htm, el procedimiento se describe en el video 59, cuando el usuario desee observar una especialidad dando clic sobre ella, el contenido de la carrera debe visualizarse en la columna derecha para ello se tiene que agregar el par&aacute;metro <span class="formatoetiquetashtml">target</span>=&quot;derecha&quot; en cada uno de los vínculos del archivo indice.htm, as&iacute; como en los enlaces del mapa de imagen.</p>
  <p class="formatoparrafo" >&nbsp;</p>
  <p align="center">
<video src="audiovideo/u2_tema11_2.mp4"  controls class="formatoajusteimagen" title="Direccionamiento de los vínculos con el parámetro target" ></video>
  </p>
  <p class="formatotitulofiguras" >Video 59. Direccionamiento de los vínculos del archivo indice.htm con el parámetro target.</p>
  <p >&nbsp;</p>
  <table width="98%" border="0" cellpadding="15">
    <tr>
      <td width="36"><a href="documentos/tema11/u2_t11_pdf3.pdf" target="new"><img src="../imagenes/icono_lectorpdf.jpg" title="Direccionando las ligas con el parámetro target"></a></td>
      <td width="785" ><span class="formatosubtitulo"><a href="documentos/tema11/u2_t11_pdf3.pdf" title="Direccionando las ligas con el parámetro target"  target="new">Direccionando los vínculos con el parámetro target</a></span></td>
    </tr>
</table>
<p>&nbsp;</p>
</main>
</body>
</html>
