<html>
<head>
<title>Introducci&oacute;n a las  hojas de  c&aacute;lculo electr&oacute;nicas</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">

<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff">
 
  <p class="formatotitulo"> 
    Introducci&oacute;n a las hojas de c&aacute;lculo electr&oacute;nicas 
    (Excel 2016)
    </p>
<p class="formatoparrafo">En el recurso que comienzas a trabajar podrás aprender el manejo de una hoja de cálculo de manera sencilla, el contenido de este material está diseñado para que te sea fácil comprenderlo con ayuda de videos. Te invitamos a que revises esta herramienta de enseñanza y mejores tus capacidades técnicas. </p>
<p class="formatoparrafo">Comienza con el estudio de la unidad y realiza las actividades de aprendizaje. </p>
<p class="formatosubtitulo">Hoja de cálculo electrónica (Excel 2016)</p>
<p class="formatoparrafo">&quot;Es una herramienta indispensable 
  en las labores acad&eacute;micas y administrativas, debido a que la informaci&oacute;n 
  en forma de tablas crece  y existe la necesidad de c&aacute;lculos 
  mayores, as&iacute; como aplicar 
  formato a la informaci&oacute;n, adem&aacute;s su capacidad para 
  resumir y sintetizar los resultados en forma de gr&aacute;ficas&quot; (Pacheco, 2016, p. 13).</p>
<p class="formatoparrafo">Con respecto a Excel una caracter&iacute;stica 
   es el 
  manejo de operaciones simples como suma, resta, multiplicaci&oacute;n 
  y divisi&oacute;n, 
  adem&aacute;s se emplean funciones en Excel previamente 
  dise&ntilde;adas y  organizadas por categor&iacute;as, entre 
  las cuales se encuentran  las financieras, matem&aacute;ticas, trigonom&eacute;tricas, 
  estad&iacute;sticas, l&oacute;gicas, bases de datos, fecha, hora y texto. Tambi&eacute;n maneja  gr&aacute;ficas, entre las cuales existen la de barras, columnas y 
  l&iacute;neas, el administrador cuenta con una base s&oacute;lida para la toma 
  de decisi&oacute;n en una determinada &aacute;rea en la organizaci&oacute;n como puede ser ventas, ingenier&iacute;a, 
  log&iacute;stica, financiero, contabilidad, recursos humanos y mantenimiento, como se aprecia en el video  1. </p>
<p class="formatocentrarimagen" >
<video class="formatoajusteimagen" src="audiovideo/u1_intro_1.mp4"  controls></video>
    </p>
  <p class="formatotitulofiguras" >Video 1. Introducción a la hoja de cálculo Excel 2016.</p>
<p  class="formatoparrafo">Excel 2016 est&aacute; formado por una serie de columnas en sentido 
  vertical que se identificaban por  letras del alfabeto se empieza por la  
  A y termina con XFD para concluir con una extensión de  16384 columnas, a su vez, se tienen  filas en 
  sentido horizontal que comienzan con el n&uacute;mero 1 y terminan en 1048576. 
  La intersecci&oacute;n de una columna y una fila se denomina celda, se identifica 
  por medio de una direcci&oacute;n  que se forma con la letra 
  de la columna y  el n&uacute;mero de  fila, como se visualiza en el video 2.</p>
<p class="formatocentrarimagen" >
    <video src="audiovideo/u1_intro_2.mp4" class="formatoajusteimagen"  controls></video>
    </p>

<p class="formatotitulofiguras" >Video 2. Estructura de la hoja de cálculo Excel 2016.</p>
<p class="formatotitulofiguras" >&nbsp;</p>
<p  class="formatoparrafo">Se invita al estudiante a iniciar la aplicaci&oacute;n de Excel 2016, en Windows 10,  existen diferentes formas de correr la hoja de c&aacute;lculo electr&oacute;nica.</p>
<p  class="formatoparrafo">La aplicación y las imágenes e iconos de Excel 2016 y Windows 10, así como sus productos diversos, son marcas registradas de la empresa Microsoft Incorporation (Microsoft, 2019).</p>
<p  class="formatoparrafo">La aplicación de Adobe PDF, sus productos e imágenes,  iconos, son marcas  registradas de la empresa Adobe System (Adobe, 2019).</p>
<p  class="formatoparrafo">La aplicación de Google Chrome, sus productos e imágenes, iconos, son marcas  registradas de la empresa Google Incorporated (Google, 2019).</p>
<p  class="formatoparrafo">Las imágenes, iconos y figuras utilizadas en el menú principal,  submenus, contenido del material didáctico digital (polilibro) son propiedad de cada autor intelectual.</p>

<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" ><p class="formatoiconopdf"><a href="documentos/intro/u1_intro_pdf1.pdf" target="new" ><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" alt="Iniciar excel 2016"></a></p></td>
    <td width="95%"><span class="formatosubtitulo"><a href="documentos/intro/u1_intro_pdf1.pdf" target="new" >Procedimiento para 
  iniciar Excel 2016 en el sistema operativo Windows 10</a></span></td>
  </tr>
</table>

<p class="formatonotas"> El presente  material es   usado exclusivamente con fines académicos y educativos sin  cuestiones  de  lucro, se otorgan los correspondientes derechos de   autor, créditos, autoría, marcas   registradas de cada imagen, texto y contenido del  presente   material educativo en las citas textuales y fuentes de consulta que son parte de este recurso. Se tomaron como base para la realización del polilibro el software de Windows 10 y Excel 2016.</p>

</body>
</html>
