<html>
<head>
<title>Actividad integradora proyecto Excel</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff">
  <main>
  <p class="formatotitulo" >Actividad integradora</p>
  <p class="formatotitulo" >C&aacute;lculo de la n&oacute;mina de una instituci&oacute;n educativa  </p>
  <p class="formatoparrafo" >La actividad integradora de la hoja de c&aacute;lculo electr&oacute;nica tiene como prop&oacute;sito realizar  procedimientos  para que el estudiante pueda reforzar los conocimientos  sobre el concepto, uso y manejo de un proyecto.</p>
<p class="formatoparrafo" >Consiste en crear y dise&ntilde;ar una n&oacute;mina de la planta docente de una instituci&oacute;n educativa, sin embargo, por cuestiones de integridad la informaci&oacute;n de los profesores no es real,  se apega a las cuestiones laborales de una escuela de grandes dimensiones, cabe recalcar que los datos vertidos en el proyecto de la n&oacute;mina son utilizados solamente para cuestiones acad&eacute;micas sin af&aacute;n de lucro. </p>
<p class="formatoparrafo" >El proyecto de la n&oacute;mina   est&aacute; formado por cuatro etapas; la primera consiste en la captura, edici&oacute;n y formato de la informaci&oacute;n de una hoja de c&aacute;lculo que tiene los datos de los docentes como son: n&uacute;mero de empleado, nombre, CURP, categor&iacute;a,  conceptos  de percepci&oacute;n, descuentos  y   total. La segunda parte   aplica fórmulas y  funciones como suma, promedio, m&aacute;ximo y m&iacute;nimo. En la tercera etapa es elaborar y diseñar una gr&aacute;fica de columnas que represente el ingreso quincenal de cada profesor. En la cuarta  se administra la informaci&oacute;n de la planta docente al ordenar alfab&eacute;ticamente a los maestros de la instituci&oacute;n, posteriormente filtrar para conocer el nombre del profesor decano  y por &uacute;ltimo  dise&ntilde;ar una tabla din&aacute;mica de los docentes por categor&iacute;a y sueldo total quincenal (Camarillo,   González,  Jiménez, &amp; Velasco, 2015).</p>
<p class="formatosubtitulo" >C&aacute;lculo de la n&oacute;mina de una instituci&oacute;n educativa</p>
  <p class="formatoparrafo" >La n&oacute;mina quincenal de los docentes de una instituci&oacute;n educativa se realiza en el libro de trabajo G2IVEHumbertoDB.xlsx se describe el procedimiento para crear la n&oacute;mina de los profesores en una hoja de c&aacute;lculo llamada n&oacute;mina docentes, en donde se capturan  los datos de los maestros, conceptos de percepci&oacute;n, descuentos y  sueldo  total (IPN. CECyT No. 7 Cuauhtémoc, entrevista a Capital  Humano, noviembre 2018).</p>
  <p >&nbsp;</p>
  <table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/integra/u1_integrapdf1.pdf" target="new" ><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" title="Actividad integradora"></a></p></td>
    <td width="95%"><span class="formatosubtitulo"><a href="documentos/integra/u1_integrapdf1.pdf" target="new" >C&aacute;lculo de la n&oacute;mina de una instituci&oacute;n educativa</a></span></td>
  </tr>
</table>
  <p>&nbsp;</p>
</main>
</body>
</html>
