<html>
<head>
<title>Crear un  libro  de  trabajo</title>
 <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff" >
<main>
<p class="formatotitulo">Crear un libro de trabajo</p>
<p class="formatoparrafo">En esta secci&oacute;n se aprende a: crear un nuevo libro, guardar, cerrar y abrir, cada procedimiento  abarca  varias formas; a trav&eacute;s del uso del rat&oacute;n, iconos y  teclas de atajo, para hacer m&aacute;s eficiente su quehacer en  Excel 2016.</p>
<p class="formatoparrafo">El presente material did&aacute;ctico digital (polilibro) de Excel 2016 tiene una finalidad,  guiar al estudiante en su aprendizaje aut&oacute;nomo, mediante la realizaci&oacute;n de actividades de aprendizaje y es el momento de iniciar la primera de ellas, consiste en crear un libro de trabajo de 3 hojas y entregarlo al docente para su evaluación. La primera actividad de aprendizaje esta descrita paso a paso, adem&aacute;s de apoyarse en videos. Que tengas un magnífico comienzo y recuerda que tu profesor esta contigo en la realizaci&oacute;n de la actividad, te apoya en cualquier momento.</p>

<p class="formatoparrafo">Para iniciar un nuevo proyecto, el primer paso es  crear un libro de trabajo, el cual contiene todas las actividades a trabajar. Enseguida se describe el procedimiento paso a paso.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf1.pdf" title="Crear un libro de trabajo" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" alt="Crear un libro de trabajo"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf1.pdf" title="Crear un libro de trabajo" target="new">Crear un 
  nuevo libro de trabajo </a ></span></td>
  </tr>
</table>

<p class="formatoparrafo">Al crear un libro y  capturar la informaci&oacute;n del proyecto en el lugar de trabajo, es necesario guardarlo y posteriormente  recuperarlo  para modificarlo, actualizarlo, imprimirlo,  en fin, realizar cualquier operaci&oacute;n. En el video 8 se describen las formas de guardar un libro de trabajo en Excel 2016.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" height="31"><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf2.pdf" title="Guardar un libro de trabajo" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" alt="Guardar un libro de trabajo"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf2.pdf" title="Guardar un libro de trabajo" target="new">Guardar 
un libro de trabajo </a></span></td>
  </tr>
</table>
<p align="center">
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema4_1.mp4" class="formatoajusteimagen" controls title="Guardar un libro de trabajo en Excel"></video></p>
<p class="formatotitulofiguras" >Video 8. Guardar un libro de trabajo en Excel.</p>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">Al terminar  de manipular un  archivo, se recomienda salir de &eacute;l para no estar utilizando memoria de la  computadora, la operaci&oacute;n de salir de un archivo, recibe el nombre de cierre  del libro.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf3.pdf" title="Cerrar un libro de trabajo" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" alt="Cerrar un libro de trabajo"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf3.pdf" title="Cerrar un libro de trabajo" target="new">Cerrar un libro de trabajo </a></span></td>
  </tr>
</table>
<p class="formatoparrafo">Para finalizar la elaboración del proyecto  de trabajo o  realizar algunas modificaciones o actualizaciones, debe abrir el libro.</p>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 1 parte 1</p>
<p class="formatosubtituloactividad" >Creaci&oacute;n de una hoja de c&aacute;lculo denominada lista de calificaciones</p>
<p class="formatoparrafo">El alumno  crea  un libro de trabajo que consta de 3 hojas de c&aacute;lculo que representa su primera actividad de aprendizaje, se apoya en las instrucciones y videos que facilitan el aprendizaje aut&oacute;nomo del estudiante.</p>
<p class="formatoparrafo">A continuaci&oacute;n 
  se crea un proyecto que consiste en un libro de trabajo en  Excel 2016, dicho libro esta 
  formado por tres hojas de c&aacute;lculo, la primera se denomina lista 
  de calificaciones, la segunda tiene por nombre funci&oacute;n senoidal 
  y la tercera se  llama venta de autos. De los datos de las hojas 
  de c&aacute;lculo emergen tres hojas que contienen los gr&aacute;ficos 
  correspondientes, la primera produce un gr&aacute;fico de barras para 
  hacer comparaciones entre los mejores promedios de un grupo y perfilarlos como 
  posibles candidatos a obtener una beca por su alto desempe&ntilde;o, la segunda que utiliza una funci&oacute;n 
  senoidal desarrolla la gr&aacute;fica correspondiente x-y dispersi&oacute;n 
  que se utiliza en la ingenier&iacute;a para demostrar la generaci&oacute;n de 
  energ&iacute;a el&eacute;ctrica, por &uacute;ltimo los datos de la hoja de c&aacute;lculo venta de 
  autos, sirven de base para la elaboraci&oacute;n de una gr&aacute;fica 
  del tipo circular, para el an&aacute;lisis de que empresa de autos vende m&aacute;s 
  unidades y que porcentaje del mercado tiene con respecto a sus competidores.</p>
<p class="formatoparrafo">La primera hoja de c&aacute;lculo tiene por objetivo recabar las  calificaciones  de la materia de Computaci&oacute;n B&aacute;sica  II de los alumnos del grupo 2IVE, como se muestra en el video 9 y  posteriormente se utiliza en la  aplicaci&oacute;n  de Excel como son edici&oacute;n, formato, f&oacute;rmulas,  funciones, ordenaci&oacute;n y graficaci&oacute;n.</p>
<p class="formatoparrafo">Los datos recabados son ficticios y no tienen ninguna relación con los estudiantes, además son utilizados para fines académicos sin afán de lucro.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" ><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf5.pdf" title="Creaci&oacute;n de una hoja de c&aacute;lculo denominada lista de calificaciones" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf5.pdf" title="Creaci&oacute;n de una hoja de c&aacute;lculo denominada lista de calificaciones" target="new">Creaci&oacute;n de una hoja de c&aacute;lculo denominada lista de calificaciones </a></span></td>
  </tr>
</table>
<p align="center">&nbsp;</p>
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema4_2.mp4" class="formatoajusteimagen" controls title="Creación de la hoja lista de calificaciones"></video></p>
<p class="formatotitulofiguras" >Video 9. Creación de la hoja lista de calificaciones.</p>
<p class="formatosubtituloactividad" >&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 1 parte 2</p>
<p class="formatosubtituloactividad" >Creaci&oacute;n de la hoja de c&aacute;lculo llamada funci&oacute;n  senoidal</p>
<p class="formatoparrafo">En el &aacute;rea de estudios de las ciencias f&iacute;sico  matem&aacute;ticas es indispensable tener presente la utilidad de Excel en la  manipulaci&oacute;n de las funciones trigonom&eacute;tricas, as&iacute; como en las  diferentes categor&iacute;as de las funciones predeterminadas:  estad&iacute;sticas, matem&aacute;ticas, financieras y l&oacute;gicas, por ello, la siguiente hoja  de c&aacute;lculo tiene como finalidad brindar una peque&ntilde;a aplicaci&oacute;n de la funci&oacute;n  senoidal, ver video 10, la cual es muy usada en el &aacute;rea el&eacute;ctrica y electr&oacute;nica.</p>
<p class="formatoparrafo">Las imágenes e iconos utilizados en la animación son propiedad de Microsoft y de la red Internet. </p>
<p class="formatosubtituloactividad" >&nbsp;</p>
	<p align="center">&nbsp;
<video src="audiovideo/u1_tema4_3.mp4" class="formatoajusteimagen" controls title="Descripción de la  función senoidal"></video></p>
<p class="formatotitulofiguras" >Video 10. Descripción de la  función senoidal.</p>
<p align="justify">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf6.pdf" title="Creaci&oacute;n de 
la hoja de c&aacute;lculo llamada funci&oacute;n senoidal" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36" alt="pdf"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf6.pdf" title="Creaci&oacute;n de 
la hoja de c&aacute;lculo llamada funci&oacute;n senoidal" target="new">Creaci&oacute;n de 
la hoja de c&aacute;lculo llamada funci&oacute;n senoidal</a></span></td>
  </tr>
</table>
	<p align="center">&nbsp; </p>
<p class="formatoparrafo">El video 11  explica paso a paso la creación de la hoja de cálculo función senoidal, la cual aplica el uso de series y la función seno.</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema4_4.mp4" class="formatoajusteimagen" controls title="Creación de la hoja función senoidal"></video>
<p class="formatotitulofiguras" >Video 11. Creación de la hoja función senoidal.</p>
<p class="formatosubtituloactividad">&nbsp;</p>
<p class="formatosubtituloactividad">Actividad de aprendizaje 1 parte 3</p>
<p class="formatosubtituloactividad">Creaci&oacute;n de la hoja de  c&aacute;lculo titulada venta de autos </p>
<p class="formatoparrafo">La  siguiente hoja de c&aacute;lculo denominada venta de autos tiene como prop&oacute;sito  mostrar las principales marcas de autos en el pa&iacute;s y el modelo de auto m&aacute;s  vendido por sus caracter&iacute;sticas comerciales, analizando los datos obtenidos de  la hoja de c&aacute;lculo se ilustra posteriormente el porcentaje del mercado  automotriz que ocupa cada marca en el pa&iacute;s, mediante la realizaci&oacute;n de una  gr&aacute;fica del tipo pastel, la cual directamente obtiene el porcentaje de cada  elemento que conforman la empresa automotriz, visualizar el video 12.</p>
<p class="formatoparrafo">Las imágenes e iconos utilizados son propiedad de las siguientes marcas: Volkswagen, Nissan, Seat, Ford, Dodge y General Motors, además son utilizados para fines académicos sin afán de lucro.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center">&nbsp; </p>
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema4_5.mp4" class="formatoajusteimagen" controls title="Descripción de la venta de autos"></video></p>
<p class="formatotitulofiguras" >Video 12. Descripción de la venta de autos.</p>
<p class="formatoparrafo">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" ><p class="formatoiconopdf"><a href="documentos/tema4/u1_t4_pdf7.pdf" title="Creaci&oacute;n de la hoja de c&aacute;lculo titulada venta de autos" target="new"><img src="../imagenes/icono_lectorpdf.jpg" width="36" height="36"></a ></p></td>
    <td width="95%" ><span class="formatosubtitulo"><a href="documentos/tema4/u1_t4_pdf7.pdf" title="Creaci&oacute;n de la hoja de c&aacute;lculo titulada venta de autos" target="new">Creaci&oacute;n de la hoja de c&aacute;lculo titulada venta de autos</a></span></td>
  </tr>
</table>

<p align="justify">&nbsp;</p>
<p class="formatoparrafo">El video 13  muestra la creación de la hoja de cálculo venta de autos, se aprecian las diferentes marcas de carros más comerciales en el país, así como los porcentajes de ventas de cada uno de ellos.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema4_6.mp4" class="formatoajusteimagen" controls title="Creación de la hoja venta de autos"></video></p>
<p class="formatotitulofiguras" >Video 13. Creación de la hoja venta de autos.</p>
<p>&nbsp;</p>
</main>
</body>
</html>
