<html>
<head>
<title>Ordenar datos</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff" >
  <main>
<p class="formatotitulo" >Administrar informaci&oacute;n </p>
<p class="formatosubtitulo" >Administraci&oacute;n de datos en una hoja de c&aacute;lculo</p>
<p class="formatoparrafo" >Una parte medular en cualquier organizaci&oacute;n es saber administrar la informaci&oacute;n que se tiene, para ello, la hoja de c&aacute;lculo electr&oacute;nica posee unas herramientas como son:  ordenar datos,  filtrar informaci&oacute;n  y crear  tablas din&aacute;micas. Al aplicar una buena administraci&oacute;n de la informaci&oacute;n  puede ayudar a obtener excelentes resultados en las actividades cotidianas en un centro de trabajo.</p>
<p class="formatosubtitulo" >Ordenar datos en una hoja de c&aacute;lculo</p>
<p class="formatoparrafo" >El proceso de captura 
  consume una gran cantidad de tiempo de las personas que colaboran en la realizaci&oacute;n 
  de un proyecto  y muy valioso es estructurar 
  la informaci&oacute;n para mostrarla, por ello, es necesario ordenarla, con el objetivo de lograr 
  una eficiencia  en el manejo de la informaci&oacute;n,  tenerla en el momento preciso que se necesita para analizarla y poder tomar 
la decisi&oacute;n. </p>
<p class="formatoparrafo" >En la parte acad&eacute;mica 
  el tema de ordenar informaci&oacute;n es indispensable en lo que respecta a lo
  administrativo, haciendo referencia al control y evaluaci&oacute;n escolar de 
  los estudiantes que integran la instituci&oacute;n,  hoy en d&iacute;a, la 
  informaci&oacute;n se encuentra en sistemas de gestión,  sin embargo, 
  una gran cantidad se localiza en hojas de c&aacute;lculo electr&oacute;nicas, 
  porque el sistema no contempla peque&ntilde;os cambios que se necesitan al instante 
  y se pueden resolver simplemente con un manejo de datos a 
  trav&eacute;s de Excel.</p>
<p align="justify">&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 5</p>
<p class="formatosubtituloactividad" >Administrar informaci&oacute;n</p>
<p class="formatoparrafo" >La actividad de aprendizaje 5 consiste en  administrar la informaci&oacute;n capturada en el libro de trabajo, mediante la realizaci&oacute;n de tres procedimientos, el primero se aplica para que los estudiantes aparezcan en orden alfab&eacute;tico ascendente. El segundo proceso se enfoca a la creaci&oacute;n de algunos filtros de informaci&oacute;n para que se muestren solamente los alumnos candidatos a obtener una beca y el tercer procedimiento se trata de la elaboraci&oacute;n de una tabla din&aacute;mica tomando como referencia la información de la hoja de c&aacute;lculo llamada venta de autos. Los datos para la creaci&oacute;n de esta actividad de aprendizaje 5 se encuentran en el  libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<p>&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 5 parte 1</p>
<p class="formatosubtituloactividad" >Ordenar datos</p>
<p align="center">&nbsp;</p>
<p class="formatoparrafo" >En la  actividad de aprendizaje 5,  crear una hoja de c&aacute;lculo electr&oacute;nica que contiene los datos de los estudiantes de la hoja llamada lista de calificaciones, mediante la condici&oacute;n  orden alfab&eacute;tico ascendente, considerando el uso de letras may&uacute;sculas y min&uacute;sculas en los datos de los alumnos, el procedimiento se realiza en el libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0">
    <tr>
      <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema9/u1_t9_pdf1.pdf" title="Ordenar datos" target="new"><img src="imagenesmenu/icono_lectorpdf.jpg" title="Ordenar datos" width="36" height="36"></a></td>
      <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema9/u1_t9_pdf1.pdf" title="Ordenar datos" target="new">Ordenar datos</a></p></td>
    </tr>
</table>

<p align="center">&nbsp; </p>
<p class="formatoparrafo">En  el video 30, se describe el proceso para formar la lista en orden alfabético del grupo de estudiantes tomando en consideración el uso de mayúsculas y minúsculas.</p>
<p class="formatoparrafo">&nbsp; </p>
<p align="center"> 
<video src="audiovideo/u1_tema9_1.mp4" class="formatoajusteimagen" controls title="Ordenar datos"></video>  </p>
<p class="formatotitulofiguras" >Video 30. Ordenar datos.</p>
<p align="justify">&nbsp;</p>

<p class="formatosubtitulo">Filtrar datos</p>
<p class="formatoparrafo" >Obtener la informaci&oacute;n 
  deseada en el m&iacute;nimo lapso de tiempo es el objetivo de filtrar datos de un volumen grande de  informaci&oacute;n, 
   la manera m&aacute;s com&uacute;n de conocerlo es con el nombre de consulta.</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 5 parte 2</p>
<p class="formatosubtituloactividad" >Filtrar datos</p>
<p class="formatoparrafo" >Continuando con la  actividad de aprendizaje 5 consiste en  filtrar la informaci&oacute;n capturada en la  hoja de c&aacute;lculo llamada lista  calificaciones ordenada, cuyo prop&oacute;sito de la consulta es obtener la informaci&oacute;n de los alumnos que tienen un promedio de 8 o mayor, para poder identificar a los estudiantes  acreedores a una beca de investigaci&oacute;n (BEIFI). </p>
<p class="formatoparrafo" >En el ejemplo, 
  del libro de trabajo G2IVEHumbertoDB.xlsx,  tomar la hoja de c&aacute;lculo 
  llamada &quot;lista  calificaciones ordenada&quot;, proceder a copiarla a una nueva hoja con el nombre &quot;lista becarios&quot; y aplicar un filtro que realice una consulta 
  para obtener la informaci&oacute;n de los estudiantes de mejor promedio, para ello se describe el siguiente procedimiento.</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0" >
    <tr>
      <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema9/u1_t9_pdf2.pdf" title="filtrar datos" target="new"><img src="imagenesmenu/icono_lectorpdf.jpg" title="filtrar datos" width="36" height="36"></a></td>
      <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema9/u1_t9_pdf2.pdf" title="filtrar datos" target="new">Filtrar datos</a></p></td>
    </tr>
</table>

<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">En  el video 31, se distinguen los estudiantes de mejor promedio mediante la aplicación de una consulta con el parámetro mayor de 8, para ser acreedores a una beca.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center"> <video src="audiovideo/u1_tema9_2.mp4" class="formatoajusteimagen" controls title="Filtrar datos"></video>  </p>
<p class="formatotitulofiguras" >Video 31. Filtrar datos.</p>
<p align="justify">&nbsp;</p>
<p class="formatosubtitulo" >Tablas din&aacute;micas</p>
<p class="formatoparrafo" >Una tabla din&aacute;mica es un informe de una hoja de c&aacute;lculo que posee una gran cantidad de datos. El prop&oacute;sito de crear una tabla din&aacute;mica es para administrar, organizar, analizar, filtrar y resumir la informaci&oacute;n m&aacute;s importante en un momento determinado, para tomar una decisi&oacute;n, cabe mencionar que para crear una tabla din&aacute;mica es necesario tener una hoja de c&aacute;lculo con la informaci&oacute;n bien estructurada que  sirva de origen para generar la tabla din&aacute;mica.</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 5 parte 3</p>
<p class="formatosubtituloactividad" >Tablas din&aacute;micas</p>
<p class="formatoparrafo" >Continuando con la  actividad de aprendizaje 5 parte 3 crear una tabla din&aacute;mica a partir de los datos de la hoja de c&aacute;lculo llamada venta de autos,  primero proceder a copiar dicha hoja a otra, se llama venta de autos din&aacute;mica, en la nueva hoja de Excel, se inserta un nuevo modelo de carro con sus caracter&iacute;sticas correspondientes para cada marca, llegando a tener dos modelos por cada marca de veh&iacute;culo, una vez que se tengan los datos completos crear una tabla din&aacute;mica en una nueva hoja, que se nombra tabla din&aacute;mica de ventas solamente incluye  los datos m&aacute;s importantes como son:  marca, modelo y  total de ventas como se muestra en la figura 14.  El procedimiento se describe a continuación.</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0">
    <tr>
      <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema9/u1_t9_pdf3.pdf" title="Tablas dinámicas" target="new"><img src="imagenesmenu/icono_lectorpdf.jpg" title="Tablas dinámicas" width="36" height="36"></a></td>
      <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema9/u1_t9_pdf3.pdf" title="Tablas dinámicas" target="new">Tablas dinámicas</a></p></td>
    </tr>
</table>
<p align="justify">&nbsp;</p>
<p align="justify" class="formatocentrarimagen"><img src="imagenes/tema9/1.11.jpg" width="700" height="453" alt="tabla  dinámica"></p>
<p class="formatotitulofiguras" >Figura 14. Tabla dinámica venta de autos.</p>
<p class="formatotitulofiguras" >&nbsp;</p>
<p class="formatoparrafo">En  el video 32, se explica paso a paso la creación de una tabla dinámica que presenta el informe de las ventas de carros por marca del sector automotriz.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center">&nbsp; 
<video src="audiovideo/u1_tema9_3.mp4" class="formatoajusteimagen" controls title="Creación de una tabla dinámica"></video>
</p>
<p class="formatotitulofiguras" >Video 32. Creación de una tabla dinámica.</p>
<p align="center">&nbsp;</p>
   
  
</main> 
</body>
</html>
