<html>
<head>
<title>creaci&oacute;n de una gr&aacute;fica</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff">
  <main>
<p class="formatotitulo">Creaci&oacute;n 
  de una gr&aacute;fica</p>
<p class="formatoparrafo">Una gr&aacute;fica 
  es la representaci&oacute;n por medio de una figura, es la relaci&oacute;n de 
  los datos de una hoja de c&aacute;lculo, cuyo objetivo consiste en simplificar 
  el an&aacute;lisis de la informaci&oacute;n, para tomar decisiones.</p>
<p class="formatoparrafo">Crear un gr&aacute;fico 
  que represente de manera sencilla el contenido de la hoja de c&aacute;lculo, 
  requiere de una metodolog&iacute;a,  se describe el procedimiento para  la creaci&oacute;n de una gr&aacute;fica (Carballero, 2013, pp. 30 - 33):</p>
<ul>
  <li class="formatoparrafo">Definir cual es 
    el objetivo o fin a lograr dentro de la organizaci&oacute;n.</li>
  <li class="formatoparrafo">Capturar los datos 
    necesarios para lograr ese prop&oacute;sito.</li>
  <li class="formatoparrafo">Estructurar la 
    informaci&oacute;n en diversas hojas de c&aacute;lculo.</li>
  <li class="formatoparrafo">Elegir el tipo 
    de gr&aacute;fico  adecuado al fin perseguido.</li>
  <li class="formatoparrafo">Crear una gr&aacute;fica fácil de interpretar y con un dise&ntilde;o.</li>
</ul>

<p class="formatosubtituloactividad" >Actividad de aprendizaje 4 </p>
<p class="formatosubtituloactividad" >Creaci&oacute;n y edici&oacute;n de gr&aacute;ficas</p>
<p class="formatoparrafo">Al momento de tener  la informaci&oacute;n: datos, f&oacute;rmulas y funciones capturadas previamente en las hojas de c&aacute;lculo del libro de trabajo llamado G2IVEHumbertoDB.xlsx, elaborar  las gr&aacute;ficas correspondientes a cada tipo de datos,  primeramente  crear una gr&aacute;fica del tipo XY dispersi&oacute;n para la hoja de c&aacute;lculo titulada funci&oacute;n senoidal. Despu&eacute;s se construye una gr&aacute;fica del tipo columnas para la hoja de c&aacute;lculo llamada lista de calificaciones. Por &uacute;ltimo se elabora una gr&aacute;fica del tipo circular aplicando los datos de la hoja de c&aacute;lculo denominada venta de autos.</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 4 parte 1</p>
<p class="formatosubtituloactividad" >Gr&aacute;fica 
del tipo XY dispersi&oacute;n</p>
<p class="formatoparrafo">Crear la gr&aacute;fica del tipo XY dispersi&oacute;n y representar la funci&oacute;n senoidal de un ciclo completo, es decir, de 360 grados. La gr&aacute;fica se localiza en una nueva hoja de c&aacute;lculo que tiene por nombre gr&aacute;fica de la funci&oacute;n senoidal y se ubica enseguida de la hoja de c&aacute;lculo llamada funci&oacute;n senoidal,  se realiza en el libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema8/u1_t8_pdf1.pdf" title="Creación de una gráfica XY" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="36" height="36" title="Creación de una gráfica XY" ></a></td>
    <td width="95%"><p class="formatosubtitulo"><a href="documentos/tema8/u1_t8_pdf1.pdf" title="Creación de una gráfica XY" target="new">Creación de una gráfica XY &quot;función senoidal&quot;</p></td>
  </tr>
</table>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">En  el video 26, se visualiza  crear la gráfica del tipo XY dispersión titulada función senoidal de un ciclo completo de 360°.</p>
<p align="justify">&nbsp;</p>
<p align="center"> <video src="audiovideo/u1_tema8_1.mp4" class="formatoajusteimagen" controls title="Creación de la gráfica función senoidal"></video>  </p>

<p class="formatotitulofiguras" >Video 26. Creación de la gráfica función senoidal.</p>
<p>&nbsp;</p>
<p class="formatosubtitulo" >Tipos de gr&aacute;ficas</p>
<p class="formatoparrafo" >Existen una gran  cantidad de gr&aacute;ficas, sin embargo, la parte 
  importante radica en lo que se muestra al usuario final, ll&aacute;mese alumno, maestro, subdirector, director,  por ello, es vital entender que aunque existan diferentes tipos de gr&aacute;ficas  seleccionar la  adecuada a nuestro prop&oacute;sito, a continuaci&oacute;n se describen algunos de los tipos de gr&aacute;ficas 
  m&aacute;s usados en el ambiente acad&eacute;mico y empresarial.</p>
<p class="formatoparrafo">En 
          la pr&aacute;ctica  se visualizan  gráficas  en   libros, revistas, art&iacute;culos, 
          publicaciones, peri&oacute;dicos, gacetas, etc., entre los tipos de gr&aacute;ficas que se observan en la figura 7, se enlistan las siguientes:</p>
<ul>
            <li class="formatoparrafo">Columnas.</li>
            <li class="formatoparrafo">Barras.</li>
            <li class="formatoparrafo">L&iacute;neas.</li>
            <li class="formatoparrafo">Circulares.</li>
            <li class="formatoparrafo">XY dispersi&oacute;n.</li>
          </ul>            

  
      <p class="formatocentrarimagen"><img src="imagenes/tema8/1.10.2_1.jpg" width="658" height="485" alt="Insertar gráfico">
      
      <p class="formatotitulofiguras" >Figura 7. Tipos de gráficas.</p></td>
    
<p>&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 4 parte 2</p>
<p class="formatosubtituloactividad" >Gr&aacute;fica   del tipo columnas</p>
<p class="formatoparrafo" >Continuando  la  actividad de aprendizaje 4, realizar el procedimiento paso a paso que se describe, para crear la gr&aacute;fica del tipo columnas,  representa los promedios de los estudiantes del grupo 2IVE. La gr&aacute;fica se localiza en una nueva hoja de c&aacute;lculo que tiene por nombre gr&aacute;fica de promedios y se coloca enseguida de la hoja de c&aacute;lculo titulada lista de calificaciones, se realiza en el libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">Este 
        tipo de gr&aacute;fica es ideal para la realizaci&oacute;n de comparaciones 
        entre diferentes elementos de un conjunto, cabe resaltar 
        que las categor&iacute;as o los elementos del conjunto se encuentran 
        en el eje &quot;X&quot;, su valor correspondiente    sobre el 
      eje &quot;Y&quot;, como se distingue en la figura 8. </p>

  
      <p class="formatocentrarimagen"><img src="imagenes/tema8/1.10.2_2.jpg" width="89" height="77" alt="Gráfica tipo columna"></p>
        <p class="formatotitulofiguras" >Figura 8. Gráfica de columnas.</p>
          <p class="formatoparrafo" >Construir  una gr&aacute;fica del tipo columnas, tomando como base la informaci&oacute;n contenida en la hoja de c&aacute;lculo llamada lista de calificaciones del libro de trabajo G2IVEHumbertoDB.xlsx, el objetivo a cumplir con la elaboraci&oacute;n   es ubicar de manera gr&aacute;fica a los mejores promedios del grupo. A continuaci&oacute;n se describe  el procedimiento   para crear la gr&aacute;fica.</font></p>
<p align="justify">&nbsp;</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema8/u1_t8_pdf2.pdf" title="Procedimiento para la creación de una gráfica del tipo columnas" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="36" height="36" title="Procedimiento para la creación de una gráfica del tipo columnas" ></a></td>
    <td width="95%"><p class="formatosubtitulo"><a href="documentos/tema8/u1_t8_pdf2.pdf" title="Procedimiento para la creación de una gráfica del tipo columnas" target="new">Creaci&oacute;n de una gr&aacute;fica  de columnas &quot;promedios&quot;</p></td>
  </tr>
</table>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">En  el video 27, se describe detalladamente la creación de una gráfica de columnas, que representa los promedios de los estudiantes.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center"> <video src="audiovideo/u1_tema8_2.mp4" class="formatoajusteimagen" controls title="Creación de la gráfica promedios"></video></p>
<p class="formatotitulofiguras" >Video 27. Creación de la gráfica promedios.</p>
<p align="center">&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 4 parte 3</p>
<p class="formatosubtituloactividad" >Gr&aacute;fica  del tipo circular</p>
<p class="formatoparrafo" >Continuando la  actividad de aprendizaje 4,  crear la gr&aacute;fica de venta de autos, que representa los porcentajes de ventas que tiene cada marca de carros dentro de la industria automotriz. La gr&aacute;fica se crea en una nueva hoja, se titula gr&aacute;fica de venta de autos y se coloca enseguida de la hoja de c&aacute;lculo que tiene los datos para graficar,  se realiza en el libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">Este tipo de gr&aacute;fica es muy utilizada en empresas y  organizaciones 
        p&uacute;blicas, su &aacute;rea de aplicaci&oacute;n radica primordialmente 
        en ventas, finanzas y diversos departamentos administrativos, sin embargo, 
        en la parte acad&eacute;mica tambi&eacute;n es  empleada en diferentes 
        disciplinas. La figura 9, es un ejemplo  &uacute;til representando la  contribuci&oacute;n en medidas de 
        porcentaje de cada uno de los elementos de la categor&iacute;a, 
      con respecto del total que suman dicho conjunto de valores.</p> 

  <p class="formatocentrarimagen"><img src="imagenes/tema8/1.10.2_15.jpg" width="68" height="60" alt="Gráfica tipo  circular"></p>
        <p class="formatotitulofiguras" >Figura 9. Gráfica circular.</p>
      
<p class="formatoparrafo" >El ejemplo a utilizar 
  en este tipo de gr&aacute;fica, es el que se  obtiene de la hoja de c&aacute;lculo 
  llamada venta de autos del libro de trabajo G2IVEHumbertoDB.xlsx, utilizar 
  como datos la columna de total y como nombre de categor&iacute;a las marcas 
  de los diferentes tipos de autom&oacute;viles, el objetivo de graficar es analizar  las ventas de la industria automotriz,  enseguida se describe el procedimiento para su realizaci&oacute;n.</p>

<table width="100%" border="0"  cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema8/u1_t8_pdf3.pdf" title="Procedimiento para la creación de una gráfica del tipo circular para representar los porcentajes de ventas de las diferentes marcas de la rama automotriz" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="36" height="36" title="Procedimiento para la creación de una gráfica del tipo circular" ></a></td>
    <td width="95%"><p class="formatosubtitulo"><a href="documentos/tema8/u1_t8_pdf3.pdf" title="Procedimiento para la creación de una gráfica del tipo circular " target="new">Creaci&oacute;n de una gr&aacute;fica  circular &quot;venta de autos&quot;</p></td>
  </tr>
</table>
<p align="center">
<p class="formatoparrafo">El video 28, ilustra la creación de una gráfica circular titulada venta de autos, representando la participación de cada marca en el mercado automotriz.</p>
<p>&nbsp;</p>
<p class="formatocentrarimagen" >
<video src="audiovideo/u1_tema8_3.mp4" class="formatoajusteimagen" controls title="Creación de la gráfica venta de autos"></video></p>
<p class="formatotitulofiguras" >Video 28. Creación de la gráfica venta de autos.</p>
<p align="center">&nbsp;</p>

<p class="formatotitulo" >Edici&oacute;n   de una gr&aacute;fica</p>
<p class="formatoparrafo">Editar  una gr&aacute;fica, es un procedimiento necesario para mejorar el dise&ntilde;o y contenido 
          del gr&aacute;fico, como se aprecia en la figura 10, debido a que el software define los par&aacute;metros 
          iniciales con los cuales se construye la gr&aacute;fica, sin embargo, el usuario puede 
          modificar posteriormente  las caracter&iacute;sticas que desee, entre las cuales se mencionan: 
          </p>
          <ul>
            <li class="formatoparrafo">Formato y tipo del gr&aacute;fico.</li>
            <li class="formatoparrafo">Datos de origen.</li>
            <li class="formatoparrafo">Opciones del gr&aacute;fico.</li>
            <li class="formatoparrafo">Ubicaci&oacute;n del 
              gr&aacute;fico.</li>
        </ul>
  <p class="formatocentrarimagen"><img src="imagenes/tema8/1.10.3_1.jpg" width="266" height="344" alt="Edición de una  gráfica"></p>
        <p class="formatotitulofiguras" >Figura 10. Edición de una  gráfica.</p>
      <p align="justify">&nbsp;</p>
<p class="formatosubtituloactividad" >Actividad de aprendizaje 4 parte 4</p>
<p class="formatosubtituloactividad" >Edici&oacute;n de la gr&aacute;fica de venta de autos</p>
<p class="formatoparrafo" >Prosiguiendo,  a partir de la gr&aacute;fica de venta de autos del libro de trabajo G2IVEHumbertoDB.xlsx</font>, para modificar algunas de sus caracter&iacute;sticas, es necesario  en la  actividad de aprendizaje 4 realizar el procedimiento para editar y aplicar formato a la gr&aacute;fica venta de autos,  como se muestra en la figura 11,  el resultado se guarda  en el mismo libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo" >&nbsp;</p>
<p class="formatocentrarimagen" ><img src="imagenes/tema8/1.10.3_20.jpg" width="669" height="489" alt="gr&aacute;fica final" /></p>
<p class="formatotitulofiguras" >Figura 11. Edición de la gráfica venta de autos.</p>
<p class="formatocentrarimagen" >&nbsp;</p>
<table width="100%" border="0"  cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema8/u1_t8_pdf4.pdf" title="Edición de la gráfica de venta de autos" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="36" height="36" title="Creación de una gráfica XY" ></a></td>
    <td width="95%"><p class="formatosubtitulo"><a href="documentos/tema8/u1_t8_pdf4.pdf" title="Edición de la gráfica de venta de autos" target="new">Edici&oacute;n de la gr&aacute;fica de venta de autos</p></td>
  </tr>
</table>
<p align="center"><font face="Arial, Helvetica, sans-serif"></font></p>
<p class="formatoparrafo">En  el video 29, se explica  la edición de la gráfica llamada venta de autos, al diseñar el tipo, tamaño de letra y fondo del gráfico por mencionar algunas modificaciones.</p>
<p class="formatoparrafo">&nbsp; </p>
<p align="center">
<video src="audiovideo/u1_tema8_4.mp4" class="formatoajusteimagen" controls title="Edición de la gráfica venta de autos"></video></p>
<p class="formatotitulofiguras" >Video 29. Edición de la gráfica venta de autos.</p>
<p align="center">&nbsp;</p>
<p class="formatosubtitulo" >Edici&oacute;n de la gr&aacute;fica de promedios</p>
<p class="formatoparrafo" >Continuando la  actividad de aprendizaje 4, realiza el procedimiento,  para editar y aplicar formato a la gr&aacute;fica de promedios, como se muestra en la figura 12,  el resultado se guarda  en el libro de trabajo llamado G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo" >La gr&aacute;fica de promedios tiene que ser editada con las siguientes caracter&iacute;sticas:</p>
<p class="formatoparrafo" >1.- Poner un borde de color  azul marino y un estilo  de ancho  3.5 puntos.</p>
<p class="formatoparrafo" >2.- Establecer de fondo a la gr&aacute;fica un relleno de textura preestablecida de nombre papel seda azul.</p>
<p class="formatoparrafo" >3.- El t&iacute;tulo del gr&aacute;fico con tipo de fuente verdana, estilo negritas, tama&ntilde;o  18 y color azul marino.</p>
<p class="formatoparrafo" >4.- El nombre del eje &quot;X&quot;, con tipo de fuente  verdana, estilo negritas, tama&ntilde;o 12 y color negro. </p>
<p class="formatoparrafo" >5.- El t&iacute;tulo del eje &quot;Y&quot;, con tipo de fuente  verdana, estilo negritas, tama&ntilde;o 12 y color negro.</p>
<p class="formatoparrafo" >6.- Cambiar el tipo de gr&aacute;fico a uno de columnas en tres dimensiones, como se muestra en la figura 12. </p>
<p class="formatoparrafo" >&nbsp;</p>
<p class="formatocentrarimagen" ><img src="imagenes/tema8/1.10.3_21.jpg" width="669" height="490" alt="Edición de una gráfica  de  columnas"></p>
<p class="formatotitulofiguras" >Figura 12. Edición de la gráfica promedios.</p>
<p align="justify">&nbsp;</p>
<p class="formatosubtitulo" >Edici&oacute;n de la gr&aacute;fica funci&oacute;n senoidal</p>
<p class="formatoparrafo" >Prosiguiendo, realiza el procedimiento  para editar y aplicar formato a la gr&aacute;fica de la funci&oacute;n senoidal,  como se muestra en la figura 13, el resultado se guarda  en el libro de trabajo llamado G2IVEHumbertoDB.xlsx (Peña, 2015, pp. 171 - 186).</p>
<p class="formatoparrafo" >La gr&aacute;fica de  la funci&oacute;n senoidal se edita  con las siguientes caracter&iacute;sticas:</p>
<p class="formatoparrafo" >1.- Poner un borde de color  azul marino y un estilo de ancho de 3.5 puntos.</p>
<p class="formatoparrafo" >2.- Establecer un fondo a la gr&aacute;fica relleno de textura preestablecida titulada papel seda azul.</p>
<p class="formatoparrafo" >3.- El t&iacute;tulo del gr&aacute;fico con un tipo de fuente verdana, estilo negritas, tama&ntilde;o  20 y color azul marino.</p>
<p class="formatoparrafo" >4.- El nombre del eje &quot;X&quot; con un tipo de fuente verdana, estilo negritas, tama&ntilde;o 12 y color negro. </p>
<p class="formatoparrafo" >5.- El t&iacute;tulo del eje &quot;Y&quot; con tipo de fuente verdana, estilo negritas, tama&ntilde;o 12 y color negro.</p>
<p class="formatoparrafo" >&nbsp;</p>
<p class="formatocentrarimagen" ><img src="imagenes/tema8/1.10.3_22.jpg" width="669" height="490" alt="Edición de una gráfica  senoidal"></p>
<p class="formatotitulofiguras" >Figura 13. Edición de la gráfica función senoidal.</p>
<p></p>

</main>
</body>
</html>
