<html>
<head>
<title>Manejo de funciones</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../estilos/formatodocumento.css" rel="stylesheet" type="text/css">
<style type="text/css">
a:link {
	color: #186fd8;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #186fd8;
}
a:hover {
	text-decoration: none;
	color: #186fd8;
}
a:active {
	text-decoration: none;
	color: #186fd8;
}
</style>
</head>
<body bgcolor="#ffffff" leftmargin="20" topmargin="0" bgproperties="fixed" rightmargin="20" marginwidth="0" marginheight="0">
  <main>
<p class="formatotitulo">Manejo 
  de funciones (estad&iacute;sticas, matem&aacute;ticas, financieras, texto, l&oacute;gicas, fecha 
  y hora)</p>
<p class="formatosubtitulo">Funciones</p>
<p class="formatoparrafo">Los datos que se ingresan
  en las hojas de cálculo producen resultados. Hoy en d&iacute;a 
  se tienen herramientas como las hojas de c&aacute;lculo electr&oacute;nicas, 
  las cuales ya tienen una lista considerable de expresiones matem&aacute;ticas 
  est&aacute;ndar conocidas como funciones.</p>
<p class="formatoparrafo"> Una funci&oacute;n se define como una f&oacute;rmula predise&ntilde;ada, es 
  decir, creada previamente por programadores  para obtener un resultado, 
  los elementos que componen una funci&oacute;n son: el nombre de la funci&oacute;n, 
  par&eacute;ntesis y argumentos.</p>
<p class="formatoparrafo">La sintaxis para escribir cualquier funci&oacute;n es la siguiente: </p>
<p class="formatoparrafo"> - El nombre de la 
  funci&oacute;n debe escribirse correctamente.</p>
<p class="formatoparrafo"> - Si la funci&oacute;n va al comienzo de una f&oacute;rmula debe empezar con 
el signo =.</p>
<p class="formatoparrafo"> - Los argumentos o valores de entrada van siempre entre par&eacute;ntesis.</p>
<p class="formatoparrafo"> - Los parámetros pueden ser valores constantes (n&uacute;mero o texto) o  
referencias de celdas.</p>
<p class="formatoparrafo"> - Los argumentos deben de separarse por una coma o tambi&eacute;n por un punto 
  y coma.
</p>
<p class="formatoparrafo">La manera generalizada 
  de representar la escritura de una funci&oacute;n es la siguiente:</p>
<p class="formatoparrafo">=nombre de la funci&oacute;n(argumento1, argumento2,..., argumentoN) 
</p>
<p class="formatoparrafo">En  el video 21, se visualiza la sintaxis, empleando el nombre de la función, paréntesis y argumentos, facilitando el cálculo de las operaciones.</p>
<p class="formatoparrafo">&nbsp; </p>
<p align="center">&nbsp;  <video src="audiovideo/u1_tema7_1.mp4" class="formatoajusteimagen" controls title="Sintaxis de una función"></video> </p>
<p class="formatotitulofiguras" >Video 21. Sintaxis de una función.</p>
<p >&nbsp;</p>
<p class="formatoparrafo">Existe una gran cantidad 
  de funciones en las hojas de c&aacute;lculo, las cuales se organizan por categor&iacute;as 
  dependiendo del &aacute;rea de aplicaci&oacute;n o conocimiento como se aprecia en la figura 6, a continuación se menciona los tipos de 
  funciones:</p>
        <ul>
          <li class="formatoparrafo">Financieras.</li>
          <li class="formatoparrafo">Fecha y hora.</li>
          <li class="formatoparrafo">Matem&aacute;ticas y trigonom&eacute;tricas.</font></li>
          <li class="formatoparrafo">Estad&iacute;sticas.</li>
          <li class="formatoparrafo">B&uacute;squeda y referencia.</li>
          <li class="formatoparrafo">Base de datos.</li>
          <li class="formatoparrafo">Textos.</li>
          <li class="formatoparrafo">L&oacute;gicas.</li>
          <li class="formatoparrafo">Informaci&oacute;n.</li>
          <li class="formatoparrafo">Definidas por el usuario.</li>
        </ul>
        <p>&nbsp;</p>
      <p class="formatocentrarimagen"><img src="imagenes/tema7/1.9_1.jpg" width="454" height="372" alt="funciones"></p>
        <p class="formatotitulofiguras" >Figura 6. Tipos de funciones.</p>
      <p align="justify">&nbsp;</p>
<p  class="formatosubtitulo">Ejemplo: Como escribir correctamente el teorema de Pitágoras, empleando las funciones ra&iacute;z y potencia, en Excel</p>

<p class="formatoparrafo">Una vez entendida la sintaxis y los requisitos necesarios  para escribir correctamente una funci&oacute;n  en Excel,  es realizar un ejercicio, que consiste en escribir la f&oacute;rmula para calcular la hipotenusa de un tri&aacute;ngulo rect&aacute;ngulo, conociendo el valor de sus catetos, mediante el empleo del teorema de Pitágoras, a continuaci&oacute;n se describe el procedimiento para llevar a cabo esta labor.</p>
<p class="formatoparrafo">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" height="48"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf1.pdf" title="El teorema de pit&aacute;goras" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf1.pdf" title="El teorema de pit&aacute;goras" target="new">Ejemplo: Como escribir correctamente el teorema de Pitágoras, en Excel</a></p></td>
  </tr>
</table>
<p align="justify">&nbsp;</p>
<p class="formatoparrafo">En  el video 22, se explica el uso de la función potencia y raíz cuadrada en el teorema de Pitágoras de un triángulo rectángulo.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center">&nbsp;  <video src="audiovideo/u1_tema7_2.mp4" class="formatoajusteimagen" controls title="Teorema de Pitágoras empleando funciones"></video> </p>
<p class="formatotitulofiguras" >Video 22. Teorema de Pitágoras empleando funciones.</p>
<p align="center">&nbsp;</p>
<p align="justify" class="formatoparrafo"> Continuando con la actividad de aprendizaje 3 para insertar funciones en las hojas de c&aacute;lculo electr&oacute;nicas del proyecto, realiza el procedimiento que se describe enseguida.</p>
<p align="center" class="formatosubtitulo">Insertar funci&oacute;n seno, contar, promedio,  l&oacute;gica si, contar.si, suma, m&aacute;ximo y m&iacute;nimo</p>
<p class="formatoparrafo">En 
  el libro de trabajo denominado G2IVEHumbertoDB.xlsx y sus 3 hojas de c&aacute;lculo 
  llamadas: lista de calificaciones, funci&oacute;n senoidal y venta de autos, 
   se inicia con la hoja de c&aacute;lculo de la funci&oacute;n 
  senoidal, la cual, se presta  para la aplicaci&oacute;n de la 
  funci&oacute;n  
  seno y    contar. Posteriormente se aplica la funci&oacute;n promedio a la hoja de c&aacute;lculo 
  conocida como lista de calificaciones, tambi&eacute;n se  emplea la  funci&oacute;n l&oacute;gica si y contar.si. Para finalizar se utiliza la funci&oacute;n  suma en la hoja 
  de c&aacute;lculo titulada venta de autos, aunado a la funci&oacute;n m&aacute;ximo y m&iacute;nimo. A continuaci&oacute;n se describen 
  paso a paso cada uno de los procedimientos.</p>
<p class="formatosubtituloactividad">Actividad de aprendizaje 3 parte 3
</p>

<p class="formatosubtituloactividad">Funci&oacute;n seno y contar
</p>
<p class="formatoparrafo">La funci&oacute;n 
  senoidal es de suma importancia en el &aacute;rea de la ingenier&iacute;a, su estudio permite la explicaci&oacute;n del funcionamiento de los motores el&eacute;ctricos 
  de corriente alterna, 
  otra aplicaci&oacute;n de esta funci&oacute;n senoidal es la explicaci&oacute;n 
  de la generaci&oacute;n de energ&iacute;a el&eacute;ctrica alterna.</p>
<p class="formatoparrafo">El cálculo de la  funci&oacute;n 
  senoidal se determina en base a una serie de argumentos conocidos   
  como &aacute;ngulos en grados,  sin embargo, la hoja de c&aacute;lculo trabaja con la medida est&aacute;ndar radianes, por ello, la columna &quot;A&quot; que ejemplifica al argumento 
  de la funci&oacute;n senoidal tiene como unidad el radian, partiendo de ello, 
  se  describe el procedimiento para aplicar la funci&oacute;n 
  senoidal.</p>
<p class="formatoparrafo">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" height="42"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf2.pdf" title="Insertar la función seno" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf2.pdf" title="Insertar la  función seno" target="new">Insertar la función seno</a></p></td>
  </tr>
</table>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">En  la actividad de aprendizaje 3, realiza el procedimiento, que se describe enseguida, para insertar la funci&oacute;n contar en la hoja de c&aacute;lculo electr&oacute;nica que tiene por nombre funci&oacute;n senoidal del proyecto G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">Es importante  tener el valor de los elementos que integran una serie de datos, como es el caso de la funci&oacute;n senoidal,  para ello se utiliza la funci&oacute;n contar que viene predise&ntilde;ada en  Excel. En esta ocasi&oacute;n se  aplica a la columna &quot;B&quot;, es decir, al valor de la funci&oacute;n y = seno (x),   empleando  el icono 
de autosuma de la cinta de opciones llamada inicio, debido a que en &eacute;l se localiza la funci&oacute;n contar, el proceso se describe a continuaci&oacute;n (Carballero, 2013, pp. 51 - 58).</p>
<p class="formatoparrafo">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%" height="42"><p class="formatoiconopdf"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf.3.pdf" title="Insertar la función contar" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf3.pdf" title="Insertar la función contar" target="new">Insertar la función contar</a></p></td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p class="formatoparrafo">El video 23, ilustra de manera sucinta la forma de aplicar la función seno al ángulo en radianes de un ciclo completo de una función senoidal, además de contar los valores de la serie.</p>
<p class="formatoparrafo">&nbsp; </p>
<p align="center"> <video src="audiovideo/u1_tema7_3.mp4" class="formatoajusteimagen" controls title="Función seno y contar"></video> &nbsp;</p>
<p class="formatotitulofiguras" >Video 23. Función seno y contar.</p>
<p align="center">&nbsp;</p>
<p class="formatosubtituloactividad">Actividad de aprendizaje 3 parte 4
</p>

<p class="formatosubtituloactividad">Funci&oacute;n promedio, l&oacute;gica si, y contar si</p>
<p class="formatoparrafo">Prosiguiendo  con la actividad de aprendizaje 3, realiza el procedimiento que se describe a continuación, para insertar la funci&oacute;n promedio en la hoja de c&aacute;lculo electr&oacute;nica lista de calificaciones del proyecto G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">En el siguiente ejercicio 
  se aplica una funci&oacute;n para obtener el promedio general de la materia 
  de Computaci&oacute;n B&aacute;sica II del grupo G2IVE, mediante el empleo del icono 
  denominado insertar funci&oacute;n localizado en la barra de f&oacute;rmulas, 
  dicho procedimiento es descrito a continuaci&oacute;n.</p>

<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf4.pdf" title="Insertar la función promedio" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf4.pdf" title="Insertar la función promedio" target="new">Insertar la función promedio</a></p></td>
  </tr>
</table>
<p align="justify">&nbsp;</p>
<p class="formatoparrafo">Avanzando con la actividad de aprendizaje 3, realiza el procedimiento que se describe enseguida, para insertar la funci&oacute;n l&oacute;gica si, en la hoja de c&aacute;lculo electr&oacute;nica lista de calificaciones del proyecto G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">Una vez obtenido el promedio de cada estudiante de la materia 
  de Computaci&oacute;n B&aacute;sica II del grupo G2IVE,  utilizar este valor para que Excel, a trav&eacute;s de su funci&oacute;n l&oacute;gica si, pueda obtener la evaluaci&oacute;n final del alumno, es decir, si fue aprobado o  reprobado. Este proceso es mediante el empleo del icono 
  denominado insertar funci&oacute;n localizado en la barra de f&oacute;rmulas, 
dicho procedimiento es descrito a continuaci&oacute;n.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf5.pdf" title="Insertar función lógica si" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf5.pdf" title="Insertar función lógica si" target="new">Insertar función lógica si</a></p></td>
  </tr>
</table>
<p class="formatoparrafo">&nbsp;</p>
<p class="formatoparrafo">Prosiguiendo con la  actividad de aprendizaje 3 realiza el procedimiento que se describe a continuación, para insertar la funci&oacute;n contar.si, en la hoja de c&aacute;lculo electr&oacute;nica lista de calificaciones del proyecto G2IVEHumbertoDB.xlsx</p>
<p class="formatoparrafo">Conociendo la evaluaci&oacute;n final de cada estudiante, es decir, si fue aprobado o reprobado, es importante conocer la cantidad de alumnos que fueron aprobados, con la finalidad de saber el porcentaje de aprovechamiento escolar del grupo, para ello se emplea  la funci&oacute;n de Excel que tiene el nombre de contar.si. Este proceso es mediante el uso del icono 
  denominado insertar localizado en la barra de f&oacute;rmulas, 
dicho procedimiento es descrito a continuaci&oacute;n.</p>
<p class="formatoparrafo">&nbsp;</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf6.pdf" title="Insertar función contar si" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf6.pdf" title="Insertar función contar si" target="new">Insertar función contar si</a></p></td>
  </tr>
</table>
<p align="justify">&nbsp;</p>
<p class="formatoparrafo">En  el video 24 se distingue el uso de la función promedio, lógica si, y contar si, aplicadas a la hoja de cálculo electrónica llamada lista de calificaciones.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center"><video src="audiovideo/u1_tema7_4.mp4" class="formatoajusteimagen" controls title="Función promedio, lógica si y contar si"></video>;</p>
<p class="formatotitulofiguras" >Video 24. Función promedio, lógica si y contar si.</p>
<p align="center">&nbsp;</p>
<p class="formatosubtituloactividad">Actividad de aprendizaje 3 parte 5 </p>
<p class="formatosubtituloactividad" >Funci&oacute;n suma, m&aacute;ximo y m&iacute;nimo</p>
<p class="formatoparrafo">Continuando con la actividad de aprendizaje 3, realiza el procedimiento, que se describe enseguida, para insertar la funci&oacute;n suma en la hoja de c&aacute;lculo electr&oacute;nica que tiene por nombre venta de autos del proyecto G2IVEHumbertoDB.xlsx </p>
<p class="formatoparrafo">Conocer el total 
  de las ventas en el mercado automotriz tiene una relevancia para la  toma de decisiones,  por tal motivo,  utilizar la hoja de 
  c&aacute;lculo de venta de autos para emplear la funci&oacute;n suma y obtener las ventas 
  totales de cada sector empresarial, a partir del icono 
de autosuma de la cinta de opciones llamada inicio, el proceso se describe  a continuaci&oacute;n.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf7.pdf" title="Insertar función suma" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf7.pdf" title="Insertar función suma" target="new">Insertar función suma</a></p></td>
  </tr>
</table>
<p align="justify">&nbsp;</p>
<p class="formatoparrafo">Avanzando  con la actividad de aprendizaje 3, realiza el procedimiento que se describe a continuación, para insertar la funci&oacute;n m&aacute;ximo en la hoja de c&aacute;lculo electr&oacute;nica que tiene por nombre venta de autos del proyecto G2IVEHumbertoDB.xlsx </p>
<p class="formatoparrafo">Es importante conocer las preferencias de los clientes que consumen el producto de la industria automotriz,  por tal razón se utiliza la funci&oacute;n llamada m&aacute;ximo, con la cual se  obtiene la cantidad que  indica la demanda m&aacute;s alta en la categor&iacute;a de los autos sedan. Se emplea el icono 
de autosuma de la cinta de opciones llamada inicio,  el proceso se describe  a continuaci&oacute;n.</p>
<table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf8.pdf" title="Insertar función máximo" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf8.pdf" title="Insertar función máximo" target="new">Insertar función máximo</a></p></td>
  </tr>
</table>
<p align="justify">&nbsp;</p>
<p class="formatoparrafo">En  la actividad de aprendizaje 3, realiza el procedimiento, que se describe enseguida, para insertar la funci&oacute;n m&iacute;nimo en la hoja de c&aacute;lculo electr&oacute;nica que tiene por nombre venta de autos del proyecto G2IVEHumbertoDB.xlsx </p>
<p class="formatoparrafo">Un factor importante para la elecci&oacute;n o compra de un auto compacto radica en el precio, por ello,  auxiliarse de la funci&oacute;n llamada m&iacute;nimo, con la cual se obtiene   el valor del veh&iacute;culo que tiene el precio m&aacute;s bajo del mercado automotriz. Se utiliza el icono 
de autosuma de la cinta de opciones llamada inicio,  el proceso se describe  a continuaci&oacute;n.</p>
  <table width="100%" border="0" cellspacing="1" cellpadding="0">
  <tr>
    <td width="5%"><p class="formatoiconopdf"><a href="documentos/tema7/u1_t7_pdf9.pdf" title="Insertar función mínimo" target="new"><img src="imagenes/icono_lectorpdf.jpg" width="37" height="40" ></a></p></td>
    <td width="95%" ><p class="formatosubtitulo"><a href="documentos/tema7/u1_t7_pdf9.pdf" title="Insertar función mínimo" target="new">Insertar función mínimo</a></p></td>
  </tr>
</table>

<p align="center">&nbsp;</p>
<p class="formatoparrafo">En  el video 25 se aprecia el uso de la función suma, máximo y mínimo en la hoja de cálculo que lleva por nombre venta de autos.</p>
<p class="formatoparrafo">&nbsp;</p>
<p align="center"><video src="audiovideo/u1_tema7_5.mp4" class="formatoajusteimagen" controls title="Función suma, máximo y mínimo"></video></p>
<p class="formatotitulofiguras" >Video 25. Función suma, máximo y mínimo.</p>
<p align="justify">&nbsp;</p>
<p align="center">&nbsp;</p>
</main>
</body>
</html>
